{
  "common": {
    "link": "Вы можете посмотреть короткое видео, демонстрирующие описанный в инструкции процесс."
  },

  "menuItem": {
    "sportsman": {
      "exerciseCreation": "Создание упражнений",
      "planning": "Планирование",
      "cancelAndTransfer": "Перенос и отмена тренировок",
      "compliteTraining": "Выполнение тренировки",
      "trainingAnalitics": "Анализ проделанной работы",
      "workWithCoach": "Работа с тренером"
    },
    "coach": {
      "menuSetup": "Настройка меню",
      "groupSetup": "Работа с группами",
      "requestManagement": "Обработка заявок спортсменов",
      "manageUserInGroup": "Работа со спортсменом в группе",
      "beforePlanning": "Подготовка к планированию",
      "setPlanning": "Создание тренировочного цикла",
      "trainingAssignment": "Назначение тренировок",
      "trainingCorrection": "Корректировка тренировок"
    }
  },

  "topMenuItem": {
    "toSportsman": "Спортсмену",
    "toCoach": "Тренеру",

    "sportsman": {
      "header": "Спортивный ассистент предназначен для планирования, корректировки и анализа результатов тренировок. Спортсмен может заниматься планированием как самостоятельно, так и с помощью тренера.",
      "stepsHeader": "Для успешного планирования необходимо:",
      "step1": "1. Заполнить значения рекордов в <i>Личном кабинете</i>. Без них создание плана невозможно.",
      "step2": "2. Перейти в <i>Упражнения</i> и ознакомиться со списком справочных упражнений. Если вам их недостаточно, можно создать свои согласно инструкции в пункте ‘Создание упражнений’.",
      "footer1": "Теперь вы готовы к планированию своих тренировок. Чтобы воспользоваться услугами тренера, ознакомьтесь с пунктом инструкции ‘Работа с тренером’."
    },
    "coach": "Описание возможностей использования 'Спортивного ассистента' тренером. Перейдите в пункт меню 'С чего начать', чтобы ознакомиться с основами"
  },

  "sportsman": {
    "exerciseCreation": {
      "header1": "Упражнения бывают личные, тренерские и справочные. Справочные доступны для планирования всем. Ознакомьтесь с ними в меню <i>Упражнения</i>, чтобы решить, нужно ли вам добавлять личные упражнения.",
      "stepsHeader": "Если нужно, можно приступить к их созданию. Они будут доступны для планирования только вам. Нажмите на кнопку <b>Создать</b> для перехода к редактированию нового упражнения.",
      "step1": "1. Заполните название. Оно должно быть уникальным.",
      "step2": "2. Выберите Тип упражнения. Доступны 2 типа, соответствующие двум типам рекордов.",
      "step3": "3. Выберите одну из доступных категорий упражнений.",
      "step4": "4. Добавлять описание упражнения не обязательно.",
      "step5": "5. Проверьте данные и подтвердите создание упражнения, нажав <b>Подтвердить</b>.",
      "footer1": "Для редактирования существующего упражнения, выберите его одинарным нажатием на строку в таблице. Перейдя на страницу редактирования, вы можете удалить упражнение, нажав <b>Удалить</b>.",
      "footer2": "Создание и редактирование можно прервать, нажав кнопку <b>Отменить</b>."
    },
    "planning": {
      "header": "Планы делятся на действующие и завершенные. Действующие – планы на будущее, а завершенные остаются для формирования аналитики ваших тренировок. Каждый план составляется на 7 дней – тренировочную неделю.",
      "stepsHeader": "Чтобы запланировать новую тренировочную неделю:",
      "step1": "1. Перейдите в <i>Планы</i> и нажмите кнопку <b>Запланировать тренировки</b>.",
      "step2": "2. Выберите дату начала тренировочной недели. Нажмите <b>Создать</b>. Учтите, что даты планов не должны пересекаться.",
      "step3": "3. Система создаст вам 7 тренировочных дней. Заполните нужные вам дни, ориентируясь по датам. Для планирования нажмите <b> + </b>.",
      "step4": "4. В верхней таблице выбирайте упражнения для назначения двойным нажатием. В нижней таблице вы увидите список назначенных упражнений. Их можно менять местами кнопками 🔼 и 🔽 или удалять двойным нажатием. Завершив, нажмите кнопку <b>Подтвердить</b>.",
      "step5": "5. В таблице тренировочного дня вы увидите свои упражнения в порядке назначения. В каждое упражнение назначаются поднятия. Для этого нажмите на названии упражнения 1 раз.",
      "step6": "6. На экране поднятий нажмите <b>Добавить поднятие</b>. Повторите нажатие столько раз, сколько этапов хотите запланировать. Лишнее можно удалить, нажав на Х рядом с текстом «Поднятие (номер):».",
      "step7": "7. Заполните параметры поднятий. При желании, добавьте комментарий вверху экрана для себя. Нажмите <b>Подтвердить</b>, чтобы сохранить вернуться к планированию тренировочного дня.",
      "step8": "8. В таблице появятся отметки о запланированных поднятиях. Завершите планирование дня и нажмите <b>Подтвердить</b>.",
      "step9": "9. Завершите планирование других тренировочных дней и нажмите <b>Завершить назначение плана</b>.",
      "footer1": "После планирования, вы можете повторить действие, создавая планы на будущее. <b>Если на текущий день у вас есть план тренировок, то вы увидите таблицу тренировочного дня на Главной. </b>",
      "footer2": "Можно удалить лишний план или поменять его, нажав 1 раз на строку с его датой начала. Попав на экран с планированием дней, можно внести изменения или удалить весь план, нажав на кнопку <b>Удалить план</b>."
    },
    "cancelAndTransfer": {
      "header": "Иногда нужно перенести или отменить тренировку в одном из тренировочных дней. Чтобы упростить этот процесс, Спортивный Ассистент предлагает специальный функционал.",
      "stepsHeader": "Для выполнения действия:",
      "step1": "1. Перейдите в <i>Планы</i> и нажмите 1 раз на строку с нужной датой в действующих планах.",
      "step2": "2. Выберите нужны тренировочный день и нажмите <b> - </b> рядом с ним.",
      "step2a": "a. Для отмены действия нажмите <b>Назад</b>.",
      "step2b": "b. Для отмены упражнений на день нажмите <b>Отменить</b>.",
      "step3": "3. Для переноса тренировки выберите дату в календаре. Она должна быть в рамках текущего тренировочного плана. Тренировки в целевой будут записаны и сотрут старые, если они там были. Нажмите <b>Подтвердить</b>.",
      "step4": "4. Подтвердите действие повторно во всплывающем окне (если оно появилось).",
      "footer1": "При отмене тренировок, они исчезнут из выбранного дня. При переносе, тренировки исчезнут из выбранного дня и появятся в дне, который вы выбрали в календаре, заменив собой все что было запланировано на этот день."
    },
    "compliteTraining": {
      "header1": "После входа в Спортивный Ассистент, если на текущий день у вас есть план тренировок, то вы увидите таблицу тренировочного дня на Главной.",
      "header2": "В таблице могут быть упражнения с фиолетовой звездочкой. При наведении курсора на них вы увидите комментарий, который относится к действиям по этому упражнению.",
      "header3": "Так же, в таблице вы увидите красные штанги, отмечающие поднятия, которые вам требуется выполнить. Поднятия группируются по процентному промежутку, в который попадает назначенный в поднятии вес. Процент рассчитывается на основе указанных вами рекордов в <i>Личном кабинете</i>",
      "stepsHeader": "Для выполнения упражнений:",
      "step1": "1. Нажмите 1 раз на значке штанги. Появится список поднятий в этом процентном промежутке.",
      "step2": "2. Ознакомьтесь со списком и выполните упражнения.",
      "step3": "3. Нажмите <b>Подтвердить выполнение</b>.",
      "step4": "4. Выбранная иконка штанги станет зеленой. Нажмите на следующую иконку штанги и повторите действия.",
      "step5": "5. Когда все штанги в таблице станут зелеными – вы завершили тренировку на день.",
      "footer1": "Выполнив все назначенные упражнения, вы автоматически позволяете статистике учитывать их в аналитических графиках, о которых написано в пункте инструкции ‘Анализ проделанной работы’."
    },
    "trainingAnalitics": {
      "header": "Для анализа того, как проходят ваши тренировки, можно воспользоваться пунктом меню <i>Аналитика</i>. На этом экране вы увидите несколько вкладок с графиками, отображающими изменение основных показателей тренировки с течением времени.",
      "stepsHeader": "Параметры:",
      "step1": "1. КПШ - количество поднятий штанги.",
      "step2": "2. Нагрузка - назначаемый в поднятиях вес.",
      "step3": "3. Интенсивность – отношение Нагрузки к КПШ.",
      "footer1": "По каждому из параметров представлен отдельный график. Так же, график есть и по типам упражнений, которые вы используете в тренировках.",
      "footer2": "Регулируйте рассматриваемый период с помощью дат «С» и «По»."
    },
    "workWithCoach": {
      "header1": "Спортсмен может делегировать необходимость планирования тренировок специалисту. В данный момент, для выбора тренера следует предварительно договориться с человеком, чтобы ваша заявка в Спортивном Ассистенте не стала для него неожиданностью.",
      "header2": "Специалист сможет назначать вам тренировочные планы, просматривать ход их выполнения, корректировать и анализировать результаты. Ему будет доступны ваши данные из <i>Планов</i>, <i>Аналитики</i> и <i>Личного кабинета</i>.",
      "stepsHeader": "Чтобы выбрать тренера, вам нужно:",
      "step1": "1. Перейдите в пункт меню <i>Личный кабинет</i>.",
      "step2": "2. Напротив текста «Мой тренер», нажмите кнопку <b>Выбрать</b>.",
      "step3": "3. Выберите из списка имя тренера, которому хотите оставить заявку на обучение. Нажмите на нужной строке 1 раз.",
      "step4": "4. Дождитесь, когда тренер примет (или отклонит) вашу заявку.",
      "footer1": "Это все, что требуется от спортсмена для начала работы с тренером.",
      "footer2": "Можно отменить поданную заявку, пока на нее не отреагировал тренер. Нажмите кнопку <b>Отменить</b> рядом с записью о заявке.",
      "footer3": "После принятия заявки, вы можете отказаться от услуг тренера. Нажмите <b>Отказаться</b> рядом с именем вашего тренера."
    }
  }
}